// LYric= [00:00.000] 作曲 : 阿鲲
// [00:01.000] 作词 : 接靓/李伟
// [00:02.000] 制作人 : 阿鲲
// [00:03.000] 编曲 : Emanuele Frusi
// [00:10.51]出品：央视新闻×网易云音乐
// [00:16.23]激情的约会 将冰雪点燃
// [00:22.63]超越极限 挑战每一次的旋转
// [00:29.49]为出发呐喊 将青春燃动
// [00:36.23]为登顶喝彩 让雪原沸腾
// [00:43.89]
// [00:44.55]疾驰  旋转 飞翔在雪的苍穹
// [00:50.93]圣火又一次点亮古城夜空
// [01:02.32]相约北京这激情的城
// [01:08.97]冰雪中我们相知相融
// [01:15.78]全世界共赴一场的冬天的梦
// [01:22.88]一起向未来美美与共
// [01:29.97]一起向未来美美与共
// [01:43.62]激情的约会 将冰雪点燃
// [01:49.88]超越极限 挑战每一次的旋转
// [01:56.85]为出发呐喊 将青春燃动
// [02:03.75]为登顶喝彩 让雪原沸腾
// [02:11.88]探索 超越 奔跑在冰的征程
// [02:18.58]汗水 蒸腾幻化出无限可能
// [02:29.86]相约北京这双奥之城
// [02:36.39]让世界更加相知相融
// [02:43.02]冰雪汇聚亿万人的冬天的梦
// [02:50.11]一起向未来美美与共
// [02:57.16]相约北京这激情的城
// [03:03.81]冰雪中我们相知相融
// [03:10.57]全世界共赴一场的冬天的梦
// [03:17.61]一起向未来美美与共
// [03:48.61]相约北京这激情的城
// [03:55.01]冰雪中我们相知相融
// [04:01.97]全世界共赴一场的冬天的梦
// [04:09.16]一起向未来美美与共
// [04:15.95]一起向未来美美与共
// [04:18.458] 和声 : 陈曦/何德宏
// [04:21.821] 声乐指导 : 陈曦
// [04:25.184] 录音师 : 吴身宝
// [04:28.547] 音频编辑 : 小宇/焦磊
// [04:31.910] 混音师 : 阿烈
// [04:35.273] 人声录音室 : 上海升赫录音棚
// [04:38.636] 监制 : 李伟/关欣
// [04:41.999] 企划 : 冯媛媛/冉启升
// [04:45.362] 本歌曲来自〖云上工作室〗
// [04:48.725] 10亿现金激励，千亿流量扶持！
// [04:52.088] 业务联系：yunmusic_2013@163.com

export function parseLyric(lyricString){

    // const parseExp1 = /\[(\d{2}:\d{2}:)\.\d{2,3}\]/
    const parseExp = /\[(\d{2}):(\d{2})\.(\d{2,3})\]/
    const lineStrings = lyricString.split("\n")
    console.log(lineStrings);
    for(let line of lineStrings){
        if(line){
            const result = parseExp.exec(line)
            console.log(result);
            const time1 = result[1] * 60 * 1000
            const time2 = result[2] * 1000
            const time3 = result[3].length === 3: result[3]

        }
    }
}